package CodeUp_Test;

public class CodeUp_2380 {

	public static void main(String[] args) {
//		비버중학교의 오늘 급식 메뉴는 롱케이크이다. 
//		학생들은 한 줄로 서서 자기 차례가 되면 학생들의 수만큼으로 자를 수 있는 케이크 1조각을 가져간다.
//		학생들은 롱케이크에 올려진 과일 토핑을 보고 원하는 케이크 조각을 선택할 수 있다.
//		그 케이크 조각이 다른 부분과 연결되어 있는 경우에는 빵칼을 사용해서 잘라내야 한다.
//		그 조각의 위치 또는 좌우 상태에 따라 빵칼의 사용 횟수가 달라진다.
//		예를 들어, 6명의 학생 중 처음 3명의 학생이 차례대로 5번, 1번, 6번 위치의 케이크를 가져간다고 할 때 빵칼을 사용하는 횟수는 다음과 같다.
//		10명의 학생이 차례대로 줄 서 있고, 
//		학생이 가져간 케이크의 번호가 차례대로 7, 4, 1, 10, 2, 3, 5, 6, 8, 9 일때, 
//		빵칼을 1번 사용하는 학생의 수와 빵칼을 2번 사용하는 학생의 수를 구해보자
		

	}

}
